class Solution:
    def isValid(self, s: str) -> bool:
        #создам стек для хранения открывающих скобок
        stack = []
        #создам словарь для соответствия открывающих и закрывающих скобок
        brackets = {")": "(", "]": "[", "}": "{"} 

        for c in s:
            if c not in brackets:
                #если текущий символ является открывающей скобкой, 
                #добавляем его в стек
                stack.append(c)
            else:
                if stack and stack[-1] == brackets[c]:
                    #если текущий символ является закрывающей скобкой, 
                    #проверяем, соответствует ли последняя открывающая скобка в стеке
                    stack.pop()
                else:
                    return False

        return len(stack) == 0

#проверки на корректность работы функции isValid
assert Solution().isValid("([])") is True, "Валидно"
assert Solution().isValid("([)]") is False, "Невалидно"
assert Solution().isValid("((()))") is True, "Валидно"


#Вывод:
# Время - O(n): один проход по строке.
# Дополнительная память - O(n) для стека
# Стек подходит, потому что закрывающая скобка относится к последней ещё не закрытой открывающей
# - это принцип LIFO, потому что мы ложим сверху вниз, 
# а закрывающая скобка относится к последней открытой скобке, которая ещё не закрыта 
# (положил сверху, забрал сверху).